In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/024.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

          0    1    2                    3                     4
0       NaN  NaN  NaN  Collins (R)  78,908  Marshall (D)  80,660
1       NaN  NaN  NaN                49.5%                 50.5%
2    County   PR   TP                  NaN                   NaN
3   BALDWIN    6    6                  569                   796
4  BEN HILL    7    7                 1495                  1763

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0   1   2      3      4
3   BALDWIN   6   6    569    796
4  BEN HILL   7   7   1495   1763
5      BIBB  43  43  13893  23279
6  BLECKLEY   3   3   1595   1493
7     BUTTS   7   7   3331   1704

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0      3      4
3   BALDWIN    569    796
4  BEN HILL   1495   1763
5      BIBB  13893  23279
6  BLECKLEY   1595   1493
7     BUTTS   3331   1704

In [9]:
df.columns = ['county', 'Mac Collins', 'Jim Marshall']

In [10]:
df.tail(5)

       county Mac Collins Jim Marshall
19     TURNER        1000         1006
20     TWIGGS         864         1760
21     WILCOX        1020          921
22  WILKINSON        1084         1735
23      WORTH         913          451

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

     county    candidate  votes
0   BALDWIN  Mac Collins    569
1  BEN HILL  Mac Collins   1495
2      BIBB  Mac Collins  13893
3  BLECKLEY  Mac Collins   1595
4     BUTTS  Mac Collins   3331

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 3 columns):
county       42 non-null object
candidate    42 non-null object
votes        42 non-null int64
dtypes: int64(1), object(2)
memory usage: 1.1+ KB

In [16]:
df['office'] = 'U.S. Representative'

In [17]:
df['district'] = '8'

In [18]:
df['party'] = ''

In [19]:
df.loc[df['candidate'] == 'Mac Collins', 'party'] = 'Republican'
df.loc[df['candidate'] == 'Jim Marshall', 'party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate     party
Jim Marshall  Democrat      80660
Mac Collins   Republican    78908
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county               office district       party    candidate  votes
0   BALDWIN  U.S. Representative        8  Republican  Mac Collins    569
1  BEN HILL  U.S. Representative        8  Republican  Mac Collins   1495
2      BIBB  U.S. Representative        8  Republican  Mac Collins  13893
3  BLECKLEY  U.S. Representative        8  Republican  Mac Collins   1595
4     BUTTS  U.S. Representative        8  Republican  Mac Collins   3331

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')